// Написать программу, которая из имеющего масива строк формирует массив из строк, 
// длина которых меньше или равна 3 символам. Первоначальный массив можно ввести с клавиатуры, 
// либо задать на старте выполнения алгоритма. 
// При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


string [] array = new string [6] {"Work", "IT",":D", "aaaaaaaaaaaa", "12!/13", "ye"};

int 

Console.WriteLine("Имеющийся массив: ");